AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПоставщика</Name>
					<Comment>!не используется с 09 февраля 2016</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИсторияХраненияИзмененийЗагружСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияХраненияИзмененийЗагружСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоAvarda</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗаказПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКорЗаказаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДопКорЗаказаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОстатокПоСкладу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЗаказаПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЗаказаПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаПоступленияНаСкладФилиала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/СобраноПоЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СобраноПоЗаказу</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварДоставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПередан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНеДоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/PM_6951_FOR_PORTAL_EX/Ext/Module.bsl
Функция PM_6951_FOR_PORTAL_EX(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_6951_FOR_PORTAL_EX", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. PM_6951_FOR_PORTAL_EX");    
	
	ЗаписьЖурналаРегистрации("Web-сервис PM_6951_FOR_PORTAL_EX", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_6951_FOR_PORTAL_EX: " + Символы.ПС 
	                     + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = PM_6951_FOR_PORTAL_EX_(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_6951_FOR_PORTAL_EX", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_6951_FOR_PORTAL_EX " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат; 		
КонецФункции

Функция PM_6951_FOR_PORTAL_EX_(ПараметрыОтбора) Экспорт
	
	//получаем входящие параметры
	пДатаНачалаОтчета	  = Дата(ПараметрыОтбора.BEGIN_DATE_);
	пДатаКонцаОтчета	  = Дата(ПараметрыОтбора.END_DATE_);
	пКодКонтрагентаПортал = ПараметрыОтбора.KONTRAGENT_; 
	пСтатусыЗаказов       = ПараметрыОтбора.DSTATE_;
	пАртикулТовара = ПараметрыОтбора.ARTICUL;
	пНомерДокумента = ПараметрыОтбора.NOMER_DOC;
	
	//разложим строку Филиалов
	пФилиалы		= СокрЛП(ПараметрыОтбора.FILIALS); 
	пСписокФилиалов = Новый Массив;

	Если ЗначениеЗаполнено(пФилиалы)  И НЕ Константы.НеПроверятьФилиалВВэбСервисах.Получить() Тогда
		пСписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(пФилиалы), ",");
	КонецЕсли;

	
	ИДАвардаКонтрагента = СтрЗаменить(СокрЛП(пКодКонтрагентаПортал),Символы.НПП,"");
		
	//Создаем объект для возврата
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6951_FOR_PORTAL_EX.ПространствоИмен, "RS_PM_6951_FOR_PORTAL_EX");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6951_FOR_PORTAL_EX.ПространствоИмен, "Out_PM_6951_FOR_PORTAL_EX");  
	
	//Ищем контрагента
	ИскатьПоКодуМДМ = СтрДлина(ИДАвардаКонтрагента) = 36;
	
	Если ИскатьПоКодуМДМ Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИДАвардаКонтрагента);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", ИДАвардаКонтрагента);	
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() Или НЕ пСписокФилиалов.Количество() = 0 Тогда
		
		ЗапросЗаказовПоСтатусам = Новый Запрос;
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета),НачалоДня(ТекущаяДата() - 86400*14)));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("IDАварда", ИДАвардаКонтрагента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СписокИД", пСписокФилиалов);
		
		ОчищенныйКодПроизводителя = "";
		СтрокаПроверки = СокрЛП(пАртикулТовара);
		Длина = СтрДлина(СтрокаПроверки); 
		
		Для а = 1 По Длина Цикл    
			
			Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
				ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
			КонецЕсли;    
			
		КонецЦикла;       
		
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Артикул", ?(СокрЛП(ОчищенныйКодПроизводителя) <> "", "%" + ОчищенныйКодПроизводителя + "%", ""));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("НомерДокумента", СокрЛП(пНомерДокумента));
		
		
		ДокументЗаказа = Неопределено;
		
		Если ЗначениеЗаполнено(СокрЛП(пНомерДокумента)) Тогда
			
			ЗапросДокумента = Новый Запрос;
			ЗапросДокумента.Текст = "ВЫБРАТЬ
			|	ЗаказыПокупателейОбороты.ЗаказПокупателя
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , Регистратор, ) КАК ЗаказыПокупателейОбороты
			|ГДЕ
			|	(ЗаказыПокупателейОбороты.ЗаказПокупателя.Номер = &Номер
			|			ИЛИ ЗаказыПокупателейОбороты.Регистратор.Номер = &Номер)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказыПокупателейОбороты.ЗаказПокупателя";
			
			ЗапросДокумента.УстановитьПараметр("Номер", СокрЛП(пНомерДокумента));
			
			ВыборкаДокумента = ЗапросДокумента.Выполнить().Выбрать();
			
			Если ВыборкаДокумента.Следующий() Тогда
				ДокументЗаказа = ВыборкаДокумента.ЗаказПокупателя;
			КонецЕсли;		
			
		КонецЕсли;
		
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДокументЗаказа", ДокументЗаказа);
		
		Если пСписокФилиалов.Количество() <> 0 Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ИДАварда
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.IDАварда = &IDАварда
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ТаблицаКлиентов
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(Контрагенты.IDФилиала В(&СписокИД) ИЛИ Контрагенты.КодМДМ В(&СписокИД))
			|	И Контрагенты.ГоловнойКонтрагент В
			|			(ВЫБРАТЬ
			|				ИДАварда.Ссылка
			|			ИЗ
			|				ИДАварда КАК ИДАварда)
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|";
		Иначе
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ТаблицаКлиентов
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|";
		КонецЕсли;
		
		Если ИскатьПоКодуМДМ Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");	
		КонецЕсли;
		
		ЗапросЗаказовПоСтатусам.Текст = ТекстЗапроса;
		
		
		//Добавила расчет полей в зависимости от константы ДатаОтправкиСтатусаДоставкиНаПортал
		//Доставлено = РН Продажи, где у Документа продажи (РТУ) установлено свойство Товар передан
		//На доставке = Колво из документа Грузовое место (проведен и V Погружено) - Доставлено
		//Готово к погрузке = РН Собрано по заказу - ?(На доставке>0, На доставке, Доставлено)
		
		ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал = Константы.ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал.Получить();
		
		Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал) Тогда
			ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал);  			
		Иначе
			
			ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", Дата("22000101"));
			
			Если пСтатусыЗаказов = "50" Тогда 
				пСтатусыЗаказов = ""; 
			КонецЕсли;

		КонецЕсли;			
		
		ЗапросЗаказовПоСтатусам.Текст =ЗапросЗаказовПоСтатусам.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЗаказПокупателяТовары.Цена) КАК Цена,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	МАКСИМУМ(ЗаказПокупателяТовары.Комментарий) КАК Комментарий,
		|	МИНИМУМ(ВЫБОР
		|		КОГДА СобственныеСклады.Ссылка ЕСТЬ NULL
		|				ИЛИ СобственныеСклады.Ссылка = ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
		|				ИЛИ НЕ СобственныеСклады.ИсключитьИзОбщегоЭкспресса
		|			ТОГДА """"
		|		ИНАЧЕ СобственныеСклады.СкладПоставщикаДляСтатусовНаПортале
		|	КОНЕЦ) КАК СкладДляПортала
		|ПОМЕСТИТЬ СгруппТаблЧасть
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ПО ТаблицаКлиентов.Ссылка = ЗаказПокупателяТовары.Ссылка.Грузополучатель
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СобственныеСклады КАК СобственныеСклады
		|			ПО ЗаказПокупателяТовары.Ссылка.IDСклада = СобственныеСклады.Идентификатор 		
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка.Проведен
		|	И ВЫБОР
		|			КОГДА &НомерДокумента = """"
		|				ТОГДА ЗаказПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|			ИНАЧЕ ЗаказПокупателяТовары.Ссылка = &ДокументЗаказа
		|		КОНЕЦ
		|	И ((ВЫРАЗИТЬ(&Артикул КАК СТРОКА(20))) = """"
		|			ИЛИ ЗаказПокупателяТовары.Номенклатура.НормализованныйКод ПОДОБНО &Артикул)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т1.Заказ,
		|	Т1.Номенклатура,
		|	МАКСИМУМ(Т1.Цена) КАК Цена,
		|	МАКСИМУМ(Т1.Количество) КАК Количество,
		|	МАКСИМУМ(Т1.Комментарий) КАК Комментарий,
		|	МИНИМУМ(ЕСТЬNULL(Т2.Статус, """")) КАК СтатусAvarda,
		|   МИНИМУМ(ВЫБОР
		|		КОГДА НЕ Т1.СкладДляПортала = """"
		|			ТОГДА Т1.СкладДляПортала
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Константы.ДопПоставщик = Т2.Документ.Контрагент
		|					ТОГДА Константы.СкладДопПоставщикаДляСтатусовНаПортале
		|				ИНАЧЕ ""ЦС в Москве""
		|			КОНЕЦ
		|	КОНЕЦ) КАК СтатусПоДопПостащику 
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	СгруппТаблЧасть КАК Т1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК Т2
		|		ПО Т1.Заказ = Т2.ЗаказПокупателя
		|			И Т1.Номенклатура = Т2.Номенклатура,
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА Константы.ОтправлятьЗаказыВСтророннююУТ11
		|				ТОГДА Константы.ДопПоставщик
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		КОНЕЦ КАК ДопПоставщик,
		|		Константы.СкладДопПоставщикаДляСтатусовНаПортале КАК СкладДопПоставщикаДляСтатусовНаПортале
		|	ИЗ
		|		Константы КАК Константы) КАК Константы
		|
		|СГРУППИРОВАТЬ ПО
		|	Т1.Заказ,
		|	Т1.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т1.Заказ,
		|	Т1.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказПоставщика.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказПоставщика.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказПоставщика,
		|	0 КАК КоличествоИстекСрок,
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказПоставщика
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказПоставщика
		|ГДЕ
		|	(ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недопоставка)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недостача)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Пересорт))
		|	И (ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя, ЗаказыПокупателейОтказПоставщика.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА ЗаказыПокупателейИстекСрок.Количество * -1
		|				ИНАЧЕ ЗаказыПокупателейИстекСрок.Количество
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЗаказыПокупателейИстекСрок.ЗаказПокупателя,
		|	ЗаказыПокупателейИстекСрок.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейИстекСрок
		|ГДЕ
		|	(ЗаказыПокупателейИстекСрок.ЗаказПокупателя, ЗаказыПокупателейИстекСрок.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейИстекСрок.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ИстекСрокРезервирования)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказКлиента.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказКлиента.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказКлиента,
		|	СУММА(0) КАК КоличествоОшибкаКратности,
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Закрыт
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказКлиента
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказКлиента
		|ГДЕ
		|	(ЗаказыПокупателейОтказКлиента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
		|			ИЛИ ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей)
		|	И (ЗаказыПокупателейОтказКлиента.ЗаказПокупателя, ЗаказыПокупателейОтказКлиента.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(0),
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОшибкаКратности.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОшибкаКратности.Количество
		|				КОНЕЦ
		|		КОНЕЦ),
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура,
		|	МАКСИМУМ(ЛОЖЬ)
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОшибкаКратности
		|ГДЕ
		|	(ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя, ЗаказыПокупателейОшибкаКратности.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейОшибкаКратности.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОшибкаКратности)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМестоТовары.Номенклатура КАК Номенклатура,
		|	ГрузовоеМестоТовары.Заказ КАК Заказ,
		|	СУММА(ГрузовоеМестоТовары.Количество) КАК КоличествоПереданноеНаДоставку
		|ПОМЕСТИТЬ ТабПереданныеНаДоставку
		|ИЗ
		|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|ГДЕ
		|	ГрузовоеМестоТовары.Ссылка.Проведен = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Погружено = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Дата >= &ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал
		|	И (ГрузовоеМестоТовары.Заказ, ГрузовоеМестоТовары.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобраноПоЗаказу.Заказ КАК Заказ,
		|	СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(СобраноПоЗаказу.Количество, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) КАК КоличествоСобранноеПоЗаказу
		|ПОМЕСТИТЬ ТабСобраноПоЗаказу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СобраноПоЗаказу.Заказ КАК Заказ,
		|		СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|		СУММА(ЕСТЬNULL(СобраноПоЗаказу.КоличествоОборот, 0)) КАК Количество
		|	ИЗ
		|		РегистрНакопления.СобраноПоЗаказу.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(Заказ, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказу
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СобраноПоЗаказу.Номенклатура,
		|		СобраноПоЗаказу.Заказ) КАК СобраноПоЗаказу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ТоварыВСборкеОстатки
		|		ПО СобраноПоЗаказу.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И СобраноПоЗаказу.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	СобраноПоЗаказу.Заказ,
		|	СобраноПоЗаказу.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Заказ КАК Заказ,
		|	ТаблЧасть.Номенклатура КАК Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) - ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) КАК Заказано,
		|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) + ЕСТЬNULL(ТоварыВПути.КоличествоОборот, 0) КАК Зарезервированно,
	//	|	ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВПути.КоличествоОборот, 0) КАК ЗаказаноПоставщику,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВПути.КоличествоОборот, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВПути.КоличествоОборот, 0)
		|	КОНЕЦ КАК ЗаказаноПоставщику, 
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
		|	КОНЕЦ КАК Собрано,
		|	ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Собирается,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) КАК ОтказПоставщика,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК ОтказИстекСрок,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) КАК ОтказКлиента,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) КАК ОтказОшибкаКратности,
		|	ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) КАК Выполнен,
		|	ТаблЧасть.Комментарий,
		|	ЕСТЬNULL(ТабПродажи.КоличествоДоставлено, 0) КАК Доставлено,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НаДоставке,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0)
		|		ИНАЧЕ ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|	КОНЕЦ КАК ГотовоКПогрузке,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.СтатусAvarda КАК СтатусAvarda,
		|	ТаблЧасть.СтатусПоДопПостащику,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РазмещениеЗаказовПокупателейОбороты.КоличествоПриход, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьЗаказ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СобраноПоЗаказуОбороты.КоличествоОборот, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСборка,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.Закрыт, ЛОЖЬ) КАК Закрыт
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		|				,
		|				(ДокументРезерва, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК ДокументРезерва,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТаблЧасть.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК ЗаказПокупателя,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОстатки
		|		ПО ТаблЧасть.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ТоварыВСборкеОстатки
		|		ПО ТаблЧасть.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказПоставщика КАК ЗаказыПокупателейОтказПоставщика
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказПоставщика.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказКлиента КАК ЗаказыПокупателейОтказКлиента
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказКлиента.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказКлиента.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
		|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
		|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПереносДоставки)
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ПродажиОбороты.КоличествоОборот
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставлено,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА (ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
		|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПереносДоставки))
		|													И ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|											ТОГДА ПродажиОбороты.КоличествоОборот
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставленоДоКорректировок
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(
		|					&ДатаНач,
		|					,
		|					Регистратор,
		|					(ЗаказПокупателя, Номенклатура) В
		|						(ВЫБРАТЬ
		|							ТаблЧасть.Заказ,
		|							ТаблЧасть.Номенклатура
		|						ИЗ
		|							ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ЗначенияСвойствОбъектов.Объект КАК Объект,
		|					ЗначенияСвойствОбъектов.Значение КАК Значение
		|				ИЗ
		|					РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ГДЕ
		|					ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|				ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПродажиОбороты.Номенклатура,
		|			ПродажиОбороты.ЗаказПокупателя) КАК ТабПродажи
		|		ПО ТаблЧасть.Заказ = ТабПродажи.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ТабПродажи.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПереданныеНаДоставку КАК ТабПереданныеНаДоставку
		|		ПО ТаблЧасть.Заказ = ТабПереданныеНаДоставку.Заказ
		|			И ТаблЧасть.Номенклатура = ТабПереданныеНаДоставку.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСобраноПоЗаказу КАК ТабСобраноПоЗаказу
		|		ПО ТаблЧасть.Заказ = ТабСобраноПоЗаказу.Заказ
		|			И ТаблЧасть.Номенклатура = ТабСобраноПоЗаказу.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК ЗаказПокупателя,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОбороты
		|		ПО ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = РазмещениеЗаказовПокупателейОбороты.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СобраноПоЗаказу.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(Заказ, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказуОбороты
		|		ПО ТаблЧасть.Заказ = СобраноПоЗаказуОбороты.Заказ
		|			И ТаблЧасть.Номенклатура = СобраноПоЗаказуОбороты.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			РазмещениеЗаказовПокупателейОбороты.Номенклатура КАК Номенклатура,
		|			РазмещениеЗаказовПокупателейОбороты.КоличествоОборот КАК КоличествоОборот
		|		ИЗ
		|			РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(
		|					,
		|					,
		|					Регистратор,
		|					(ЗаказПокупателя, Номенклатура) В
		|						(ВЫБРАТЬ
		|							ТаблЧасть.Заказ КАК Заказ,
		|							ТаблЧасть.Номенклатура
		|						ИЗ
		|							ТаблЧасть КАК ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ПО РазмещениеЗаказовПокупателейОбороты.Регистратор = ЗначенияСвойствОбъектов.Объект
		|					И (ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
		|		ГДЕ
		|			НЕ ЗначенияСвойствОбъектов.Значение ЕСТЬ NULL) КАК ТоварыВПути
		|		ПО ТаблЧасть.Номенклатура = ТоварыВПути.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВПути.ЗаказПокупателя
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Заказ КАК Заказ,
		|	ТаблЗаказа.Номенклатура КАК Номенклатура,
		|	ТаблЗаказа.Цена,
		|	МАКСИМУМ(ТаблЗаказа.Заказано) КАК Заказано,
		|	МАКСИМУМ(ТаблЗаказа.Зарезервированно) КАК Зарезервированно,
		|	МАКСИМУМ(ТаблЗаказа.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|	МАКСИМУМ(ТаблЗаказа.Собрано) КАК Собрано,
		|	МАКСИМУМ(ТаблЗаказа.Собирается) КАК Собирается,
		|	СУММА(ТаблЗаказа.ОтказПоставщика) КАК ОтказПоставщика,
		|	СУММА(ТаблЗаказа.ОтказКлиента) КАК ОтказКлиента,
		|	СУММА(ТаблЗаказа.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		|	МАКСИМУМ(ТаблЗаказа.Выполнен) КАК Выполнен,
		|	ВЫБОР
		|		КОГДА ТаблЗаказа.Комментарий ПОДОБНО ""создана автоматически при загрузке заказа покупателя с портала""
		|			ТОГДА """"
		|		ИНАЧЕ ТаблЗаказа.Комментарий
		|	КОНЕЦ КАК Комментарий,
		|	МАКСИМУМ(ТаблЗаказа.Доставлено) КАК Доставлено,
		|	МАКСИМУМ(ТаблЗаказа.НаДоставке) КАК НаДоставке,
		|	МАКСИМУМ(ТаблЗаказа.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		|	ТаблЗаказа.Количество,
		|	МИНИМУМ(ТаблЗаказа.СтатусAvarda) КАК СтатусAvarda,
		|	МИНИМУМ(ТаблЗаказа.СтатусПоДопПостащику) КАК СтатусПоДопПостащику,
		|	Склады.Наименование КАК СкладНаименование,
		|	ТаблицаКлиентов.Ссылка.Наименование КАК ГрузополучательНаименование,
		|	МАКСИМУМ(ТаблЗаказа.ЕстьЗаказ) КАК ЕстьЗаказ,
		|	МАКСИМУМ(ТаблЗаказа.ЕстьСборка) КАК ЕстьСборка,
		|	МАКСИМУМ(ТаблЗаказа.Закрыт) КАК Закрыт,
		|	СУММА(ТаблЗаказа.ОтказИстекСрок) КАК ОтказИстекСрок
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО ТаблЗаказа.Заказ.СкладГруппа = Склады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ПО ТаблЗаказа.Заказ.Грузополучатель = ТаблицаКлиентов.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Заказ,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.Цена,
		|	ТаблЗаказа.Комментарий,
		|	ТаблЗаказа.Количество,
		|	Склады.Наименование,
		|	ТаблицаКлиентов.Ссылка.Наименование
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.ДокументПродажи,
		|	ПродажиОбороты.КоличествоОборот,
		|	ПродажиОбороты.ДокументПродажи.Дата,
		|	ПродажиОбороты.ДокументПродажи.Номер
		|ПОМЕСТИТЬ ПрОб
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&ДатаНач,
		|			,
		|			,
		|			(ЗаказПокупателя, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ТаблЧасть.Заказ,
		|					ТаблЧасть.Номенклатура
		|				ИЗ
		|					ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПродажиОбороты.ДокументПродажи
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговаяТаблица.Заказ КАК Заказ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПрОб.ДокументПродажи) КАК СФ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПрОб.ДокументПродажиДата) КАК ДатаДок,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПрОб.ДокументПродажиДата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|							ТОГДА ПрОб.КоличествоОборот
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ПрОб.КоличествоОборот
		|		КОНЕЦ) КАК ДоставленоПоСФ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Номер, ПрОб.ДокументПродажиНомер) КАК НомерДок,
		|	ПрОб.ДокументПродажи,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СчетФактураВыданный.ТаксиДоставка
		|				ТОГДА ЕСТЬNULL(Грузоместа.Ссылка, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолГрузомест,
		|	СчетФактураВыданный.ТаксиДоставка
		|ПОМЕСТИТЬ СФВыданный
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПрОб КАК ПрОб
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|			ПО ПрОб.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПрОб.Номенклатура КАК Номенклатура,
		|				ПрОб.ЗаказПокупателя КАК ЗаказПокупателя,
		|				ПрОб.ДокументПродажи КАК ДокументПродажи,
		|				СчетФактураВыданный.Ссылка КАК СФ,
		|				ЕСТЬNULL(ПрОб.ДокументПродажи.ТаксиДоставка, ЛОЖЬ) КАК ТаксиДоставка
		|			ИЗ
		|				ПрОб КАК ПрОб
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|					ПО ПрОб.ДокументПродажи = СчетФактураВыданный.ДокументОснование
		|			ГДЕ
		|				СчетФактураВыданный.Проведен = ИСТИНА) КАК СчетФактураВыданный
		|			ПО ПрОб.ДокументПродажи = СчетФактураВыданный.ДокументПродажи
		|		ПО ИтоговаяТаблица.Заказ = ПрОб.ЗаказПокупателя
		|			И ИтоговаяТаблица.Номенклатура = ПрОб.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовоеМестоТовары.Ссылка) КАК Ссылка,
		|			ГрузовоеМестоТовары.Заказ КАК Заказ
		|		ИЗ
		|			ПрОб КАК ПрОб
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|				ПО ПрОб.ЗаказПокупателя = ГрузовоеМестоТовары.Заказ
		|					И ПрОб.Номенклатура = ГрузовоеМестоТовары.Номенклатура
		|					И ПрОб.ДокументПродажи = ГрузовоеМестоТовары.Ссылка.РеализацияСамовывоза
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрузовоеМестоТовары.Заказ) КАК Грузоместа
		|		ПО ИтоговаяТаблица.Заказ = Грузоместа.Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговаяТаблица.Заказ,
		|	ИтоговаяТаблица.Номенклатура,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПрОб.ДокументПродажи),
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПрОб.ДокументПродажиДата),
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Номер, ПрОб.ДокументПродажиНомер),
		|	ПрОб.ДокументПродажи,
		|	СчетФактураВыданный.ТаксиДоставка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговаяТаблица.Заказ КАК Ссылка,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	СФВыданный.СФ КАК СсылкаНаСф,
		|	СФВыданный.ДокументПродажи,
		|	СФВыданный.КолГрузомест КАК КолГрузомест,
		|	ИтоговаяТаблица.Заказ.Номер КАК DCODE_6951,
		|	ВЫБОР
		|		КОГДА СФВыданный.СФ <> НЕОПРЕДЕЛЕНО
		|			ТОГДА СФВыданный.НомерДок
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК DCODE_6051,
		|	ИтоговаяТаблица.Заказ.Дата КАК DATE_TIMESTAMP,
		|	ВЫБОР
		|		КОГДА СФВыданный.СФ <> НЕОПРЕДЕЛЕНО
		|			ТОГДА СФВыданный.ДатаДок
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК DDATE1_6051,
		|	ИтоговаяТаблица.ГрузополучательНаименование КАК FILIAL_NAME,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заказ.Комментарий КАК СТРОКА(100)) КАК DNOTE,
		|	""RUB"" КАК VALUTA_NAME,
		|	ИтоговаяТаблица.Заказ.ДоговорКонтрагента.Наименование КАК DOGOVOR_NAME,
		|	ИтоговаяТаблица.СкладНаименование КАК SKLAD_NAME,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заказ.Организация.Наименование КАК СТРОКА(80)) КАК OUR_FIRM,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заказ.Контрагент.Наименование КАК СТРОКА(80)) КАК UR_LICO,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заказ.СуммаДокумента КАК ЧИСЛО(15, 2)) КАК REZERV_SUM,
		|	ИтоговаяТаблица.Заказано КАК Заказано,
		|	ИтоговаяТаблица.Зарезервированно КАК Зарезервированно,
		|	ИтоговаяТаблица.ЗаказаноПоставщику КАК ЗаказаноПоставщику,
		|	ИтоговаяТаблица.Собирается КАК Собирается,
		|	ИтоговаяТаблица.Собрано КАК Собрано,
		|	ИтоговаяТаблица.ОтказКлиента КАК ОтказКлиента,
		|	ИтоговаяТаблица.ОтказОшибкаКратности КАК ОтказОшибкаКратности,
		|	ИтоговаяТаблица.ОтказПоставщика КАК ОтказПоставщика,
		|	ИтоговаяТаблица.ОтказИстекСрок КАК ОтказИстекСрок,
		|	ИтоговаяТаблица.Выполнен КАК Выполнен,
		|	ИтоговаяТаблица.Номенклатура.Код КАК INV_NUM,
		|	ВЫБОР
		|		КОГДА СФВыданный.СФ <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ""RUB""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК VALUTA,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК KOEF,
		|	ИтоговаяТаблица.Количество КАК KOL_VO,
		|	ИтоговаяТаблица.Цена КАК PRICE,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Комментарий КАК СТРОКА(100)) КАК TOVAR_PRIMECH,
		|	ИтоговаяТаблица.Количество * ИтоговаяТаблица.Цена КАК SUMMA,
		|	ИтоговаяТаблица.Номенклатура.КодПроизводителя КАК ARTICUL_OUT,
		|	ИтоговаяТаблица.Номенклатура.Наименование КАК TOVAR_NAME,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ИтоговаяТаблица.Номенклатура.Родитель.Наименование
		|	КОНЕЦ КАК BREND,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК ED_IZM,
		|	"" "" КАК STATUS,
		|	ИтоговаяТаблица.Количество - ИтоговаяТаблица.Выполнен КАК KOL_VO_MINUS,
		|	ИтоговаяТаблица.Заказ.ДатаОтгрузки КАК PLAN_DATE,
		|	ИтоговаяТаблица.Доставлено КАК Доставлено,
		|	ИтоговаяТаблица.НаДоставке КАК НаДоставке,
		|	ИтоговаяТаблица.ГотовоКПогрузке КАК ГотовоКПогрузке,
		|	ЕСТЬNULL(СФВыданный.ДоставленоПоСФ, 0) КАК ДоставленоПоСФ,
		|	ИтоговаяТаблица.СтатусAvarda КАК СтатусAvarda,
		|	ИтоговаяТаблица.СтатусПоДопПостащику КАК СтатусПоДопПостащику,
		|	ИтоговаяТаблица.ЕстьЗаказ КАК ЕстьЗаказ,
		|	ИтоговаяТаблица.ЕстьСборка КАК ЕстьСборка,
		|	ИтоговаяТаблица.Закрыт КАК Закрыт,
		|	ЕСТЬNULL(СФВыданный.ТаксиДоставка, ЛОЖЬ) КАК ТаксиДоставка
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ СФВыданный КАК СФВыданный
		|		ПО ИтоговаяТаблица.Заказ = СФВыданный.Заказ
		|			И ИтоговаяТаблица.Номенклатура = СФВыданный.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	DATE_TIMESTAMP УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(КолГрузомест),
		|	МАКСИМУМ(FILIAL_NAME),
		|	МАКСИМУМ(VALUTA_NAME),
		|	МАКСИМУМ(SKLAD_NAME),
		|	МАКСИМУМ(Заказано),
		|	МАКСИМУМ(Зарезервированно),
		|	МАКСИМУМ(ЗаказаноПоставщику),
		|	МАКСИМУМ(Собирается),
		|	МАКСИМУМ(Собрано),
		|	МАКСИМУМ(ОтказКлиента),
		|	СУММА(ОтказОшибкаКратности),
		|	МАКСИМУМ(ОтказПоставщика),
		|	МАКСИМУМ(ОтказИстекСрок),
		|	МАКСИМУМ(Выполнен),
		|	МАКСИМУМ(KOL_VO),
		|	МАКСИМУМ(PRICE),
		|	МАКСИМУМ(TOVAR_PRIMECH),
		|	МАКСИМУМ(SUMMA),
		|	МАКСИМУМ(STATUS),
		|	МАКСИМУМ(KOL_VO_MINUS),
		|	МАКСИМУМ(PLAN_DATE),
		|	МАКСИМУМ(Доставлено),
		|	МАКСИМУМ(НаДоставке),
		|	МАКСИМУМ(ГотовоКПогрузке),
		|	СУММА(ДоставленоПоСФ),
		|	МИНИМУМ(СтатусAvarda),
		|	МИНИМУМ(СтатусПоДопПостащику),
		|	МАКСИМУМ(ЕстьЗаказ),
		|	МАКСИМУМ(ЕстьСборка),
		|	МАКСИМУМ(Закрыт),
		|	МАКСИМУМ(ТаксиДоставка)
		|ПО
		|	Ссылка,
		|	Номенклатура";		
		
		РезультатЗапросаЗаказовПоСтатусам = ЗапросЗаказовПоСтатусам.Выполнить();
		
		Если НЕ РезультатЗапросаЗаказовПоСтатусам.Пустой() Тогда
			
			ВыборкаРезультата1 = РезультатЗапросаЗаказовПоСтатусам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРезультата1.Следующий() Цикл
				
				ВыборкаРезультата = ВыборкаРезультата1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаРезультата.Следующий() Цикл				
					
					Если ВыборкаРезультата.Заказано > 0 Тогда 
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "20; заказан", ВыборкаРезультата.Заказано, пСтатусыЗаказов);						
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;						
						
					КонецЕсли;		
					
					Если ВыборкаРезультата.Зарезервированно > 0 Тогда 
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "10; зарезервирован", ВыборкаРезультата.Зарезервированно, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;						
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ЗаказаноПоставщику > 0 Тогда 
						
						ИмяПоля      = "ЗаказаноПоставщику";
						Количество   = ВыборкаРезультата.ЗаказаноПоставщику;					
						КодСообщения = 10;                                                                                                                  
						СообщениеДляПортала = МСКWEB.СформироватьСообщениеДляПортала(ИмяПоля, Количество, ВыборкаРезультата.СтатусAvarda, КодСообщения, Ложь, 
						            ?(ВыборкаРезультата.СтатусПоДопПостащику = "", "ЦС в Москве", ВыборкаРезультата.СтатусПоДопПостащику));
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, СообщениеДляПортала, ВыборкаРезультата.ЗаказаноПоставщику, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли; 
						
					КонецЕсли;          						
					
					Если ВыборкаРезультата.Собирается <> 0 Тогда
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "30; на подборе", ВыборкаРезультата.Собирается, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;

					КонецЕсли;

					Если ВыборкаРезультата.ГотовоКПогрузке > 0 Тогда
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "40;готов к отгрузке", ВыборкаРезультата.ГотовоКПогрузке, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;

					КонецЕсли;
					
					Если ВыборкаРезультата.ОтказКлиента > 0 Тогда
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "100;отказ покупателя", ВыборкаРезультата.ОтказКлиента, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ОтказПоставщика > 0 Тогда 
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, ?(ВыборкаРезультата.ссылка.ТаксиДоставка, "110;нет на складе", "110;отказ поставщика"), 
						             ВыборкаРезультата.ОтказПоставщика, пСтатусыЗаказов);
									 
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ОтказИстекСрок > 0 Тогда 
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "110;истек срок резервирования", ВыборкаРезультата.ОтказИстекСрок, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;

					КонецЕсли;
					
					//+Сёмин Р. 16.02.2026 #UT10-5694
					//Если ВыборкаРезультата.ОтказОшибкаКратности > 0 И ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая() Тогда
					Если ВыборкаРезультата.ОтказОшибкаКратности > 0 Тогда
					//-Сёмин Р. 16.02.2026 #UT10-5694
						
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, "110;ошибка кратности", ВыборкаРезультата.ОтказОшибкаКратности, пСтатусыЗаказов);
						
						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;

					КонецЕсли;
					
					Если ВыборкаРезультата.НаДоставке > 0 Тогда
						
						ВыборкаРезультатаПоСФ = ВыборкаРезультата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаРезультатаПоСФ.Следующий() Цикл
							
							СтрокаВозврата =  ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультатаПоСФ, "50;на доставке", ВыборкаРезультатаПоСФ.НаДоставке, пСтатусыЗаказов);
							
							Если НЕ СтрокаВозврата = "" Тогда 
								РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
							КонецЕсли;
							
						КонецЦикла; 

					КонецЕсли;
					
					Если (ВыборкаРезультата.Доставлено-ВыборкаРезультата.ДоставленоПоСФ) > 0 Тогда 	
						
						//если есть отгруженные товары без СФ (предусматриваем все, что возможно)
						СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, 
						?(ВыборкаРезультата.ТаксиДоставка И КонецДня(ВыборкаРезультата.ДокументПродажи.Дата) = КонецДня(ТекущаяДата()),
						"60;Такси доставка " + ?(ВыборкаРезультата.КолГрузомест = 0, "", "(" + СокрЛП(ВыборкаРезультата.КолГрузомест) + " гр.мест)") + "", "60;выполнен"), 
						ВыборкаРезультата.Доставлено - ВыборкаРезультата.ДоставленоПоСФ, пСтатусыЗаказов);

						Если НЕ СтрокаВозврата = "" Тогда 
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
						КонецЕсли;
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ДоставленоПоСФ > 0 Тогда
						
						ВыборкаРезультатаПоСФ = ВыборкаРезультата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаРезультатаПоСФ.Следующий() Цикл 
							
							СтрокаВозврата =  ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультатаПоСФ, 
							?(ВыборкаРезультатаПоСФ.ТаксиДоставка И КонецДня(ВыборкаРезультатаПоСФ.ДокументПродажи.Дата) = КонецДня(ТекущаяДата()),
							"60;Такси доставка " + ?(ВыборкаРезультатаПоСФ.КолГрузомест = 0, "","(" + СокрЛП(ВыборкаРезультатаПоСФ.КолГрузомест) + " гр.мест)") + "", "60;выполнен"), 
							ВыборкаРезультатаПоСФ.ДоставленоПоСФ, пСтатусыЗаказов);
							
							Если НЕ СтрокаВозврата = "" Тогда 
								РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
							КонецЕсли;

						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЕсли;
		
		ДобавитьНеСозданныеЗаказыПокупателей(РезультатДляВозвратаПорталу, пДатаНачалаОтчета, пДатаКонцаОтчета, ИДАвардаКонтрагента, ТипСтрокаОтвета); 
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, СтрокаСтатус, КоличествоВСтатусе,ОтборСтатусов)

	Если ОтборСтатусов = "1000" Тогда
		Если Найти(СтрокаСтатус,"60;") > 0 Тогда Возврат ""; КонецЕсли; 
	ИначеЕсли ОтборСтатусов = "10" Тогда
		Если НЕ СтрокаСтатус = "10; зарезервирован" Тогда Возврат ""; КонецЕсли;
	ИначеЕсли ОтборСтатусов = "40" Тогда
		Если НЕ СтрокаСтатус = "40;готов к отгрузке" Тогда Возврат ""; КонецЕсли;
	ИначеЕсли ОтборСтатусов = "20" Тогда
		//Не обрабатывается
	ИначеЕсли ОтборСтатусов = "30" Тогда
		Если НЕ СтрокаСтатус = "30; на подборе" Тогда Возврат ""; КонецЕсли; 
	ИначеЕсли ОтборСтатусов = "110" Тогда
		//Не обрабатывается
	ИначеЕсли ОтборСтатусов = "50" Тогда
		Если НЕ СтрокаСтатус = "50;на доставке" Тогда Возврат ""; КонецЕсли; 
	ИначеЕсли ОтборСтатусов = "100" Тогда
		
		Если НЕ СтрокаСтатус = "100;отказ покупателя" И НЕ СтрокаСтатус = "110;нет на складе" 
			И НЕ СтрокаСтатус = "110;отказ поставщика" И НЕ СтрокаСтатус = "110;истек срок резервирования" Тогда 
			Возврат "";
		КонецЕсли; 
		
	ИначеЕсли ОтборСтатусов = "60" Тогда		
		Если Найти(СтрокаСтатус, "60;") = 0 Тогда Возврат ""; КонецЕсли;
	КонецЕсли;
	
	ТипСтрокаОтвета	= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6951_FOR_PORTAL_EX.ПространствоИмен, "Out_PM_6951_FOR_PORTAL_EX");  
	СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
	ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата,, "DCODE_6051,DDATE1_6051,VALUTA,SUMMA,KOL_VO,KOL_VO_MINUS,PLAN_DATE");
	СтрокаВозврата.DCODE_6951 = СокрЛП(СтрокаВозврата.DCODE_6951) + "(" + ?(ВыборкаРезультата.Ссылка.ТаксиДоставка, "Такси", 
	          СтрЗаменить(ВыборкаРезультата.Ссылка.СпособДоставки, "Наша д", "Д")) + ")";	

	Если Найти(СтрокаВозврата.TOVAR_PRIMECH,"Стор") = 0 Тогда
		
		Если НЕ ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая() Тогда
			
			//+Белов А. 22.10.2024 #UT10-4825
			Если (СтрДлина(СтрокаВозврата.TOVAR_PRIMECH) + СтрДлина(" Стор " + СокрЛП(ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Идентификатор))) <= 80 Тогда
				СтрокаВозврата.TOVAR_PRIMECH = СтрокаВозврата.TOVAR_PRIMECH + " Стор " + СокрЛП(ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Идентификатор);
			КонецЕсли; 		
			//	Соответствие = МСК.ПолучитьСоответствиеСтороннегоСкладаСкладуФилиала(Неопределено, ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад);
			//	IDСклада = ?(Соответствие = Неопределено, ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Идентификатор, Соответствие.СтороннийСклад.Идентификатор);
			//	
			//	Если (СтрДлина(СтрокаВозврата.TOVAR_PRIMECH) + СтрДлина(" Стор " + СокрЛП(IDСклада))) <= 80 Тогда
			//		СтрокаВозврата.TOVAR_PRIMECH = СтрокаВозврата.TOVAR_PRIMECH + " Стор " + СокрЛП(IDСклада);
			//	КонецЕсли;
			//-Белов А. 22.10.2024 #UT10-4825
			
		КонецЕсли; 
			
	КонецЕсли;
	
	ЕстьРН = ЗначениеЗаполнено(ВыборкаРезультата.СсылкаНаСФ);

	СтрокаВозврата.DID_6951    = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());
	СтрокаВозврата.DDATE1_6951 = Формат(ВыборкаРезультата.DATE_TIMESTAMP, "ДФ='dd.MM.yyyy HH:mm'");
	
	Если ЕстьРН Тогда
		
		//отображаем не РН, а СФ)
		СтрокаВозврата.DID_6051    = СокрЛП(ВыборкаРезультата.СсылкаНаСФ.УникальныйИдентификатор());
		///
		СтрокаВозврата.DDATE1_6051 = Формат(ВыборкаРезультата.DDATE1_6051, "ДФ='dd.MM.yyyy HH:mm'");
		СтрокаВозврата.DCODE_6051 = ВыборкаРезультата.DCODE_6051;
		СтрокаВозврата.VALUTA = ВыборкаРезультата.VALUTA;
		
	КонецЕсли;
	
	СтрокаВозврата.STATUS = СокрЛП(СтрокаСтатус);
	СтрокаВозврата.KOL_VO_MINUS = КоличествоВСтатусе;
	СтрокаВозврата.KOL_VO = КоличествоВСтатусе;
	
	Попытка
		СтрокаВозврата.SUMMA = КоличествоВСтатусе * ВыборкаРезультата.PRICE;
	Исключение
		СтрокаВозврата.SUMMA = 0;
	КонецПопытки;

	мМожноКорректировать = Истина;     

	Если СтрокаСтатус = "50;на доставке"
		ИЛИ НЕ Найти(СтрокаСтатус,"60;") = 0  
		ИЛИ СтрокаСтатус = "100;отказ покупателя"
		ИЛИ СтрокаСтатус = "110;отказ поставщика"
		ИЛИ СтрокаСтатус = "110;нет на складе"
		ИЛИ СтрокаСтатус = "110;истек срок резервирования"
		Тогда
		мМожноКорректировать = Ложь;
	ИначеЕсли СтрокаСтатус = "30; на подборе" Тогда		
		мМожноКорректировать = МСКWEB.ПроверитьСтатусСборки(ВыборкаРезультата.Ссылка,ВыборкаРезультата.Номенклатура); 
	ИначеЕсли СтрокаСтатус = "40;готов к отгрузке" Тогда		
		мМожноКорректировать = МСКWEB.ПроверитьСтатусОтгрузки(ВыборкаРезультата.Ссылка,ВыборкаРезультата.Номенклатура);
	КонецЕсли;
	
	Если мМожноКорректировать Тогда 
		мМожноКорректировать = НЕ Константы.ЯчейкаДляПеремещенияОтказовКлиентов.Получить().Пустая(); 
	КонецЕсли;
	
	Если мМожноКорректировать Тогда 
		мМожноКорректировать = ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая(); 
	КонецЕсли;
	
	Если мМожноКорректировать И ВыборкаРезультата.Ссылка.ТолькоРезерв Тогда 
		мМожноКорректировать = Ложь; 
	КонецЕсли; 
	
	СтрокаВозврата.FLAG_1 = МСКWEB.ПолучитьСписокДействийСЗаказом(ВыборкаРезультата.Ссылка, ВыборкаРезультата.ЕстьСборка, ВыборкаРезультата.ЕстьЗаказ, мМожноКорректировать);
	
	Если НЕ ВыборкаРезультата.Зарезервированно = 0 ИЛИ НЕ ВыборкаРезультата.ЗаказаноПоставщику = 0 
		ИЛИ НЕ ВыборкаРезультата.Заказано = 0 ИЛИ НЕ ВыборкаРезультата.Собирается = 0 ИЛИ НЕ ВыборкаРезультата.Собрано = 0 Тогда
		СтрокаВозврата.PLAN_DATE = ?(ЗначениеЗаполнено(ВыборкаРезультата.PLAN_DATE), Формат(ВыборкаРезультата.PLAN_DATE, "ДФ=dd.MM.yyyy"), "");
	КонецЕсли;	

	Возврат СтрокаВозврата;

КонецФункции

Процедура ДобавитьНеСозданныеЗаказыПокупателей(РезультатДляВозвратаПорталу, пДатаНачалаОтчета, пДатаКонцаОтчета, ИДАвардаКонтрагента, ТипСтрокаОтвета)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателейТовары.NumberInv КАК INV_NUM,
	|	"""" КАК VALUTA,
	|	НеСозданныеЗаказыПокупателейТовары.Кратность КАК KOEF,
	|	НеСозданныеЗаказыПокупателейТовары.Count КАК KOL_VO,
	|	НеСозданныеЗаказыПокупателейТовары.Price КАК PRICE,
	|	НеСозданныеЗаказыПокупателейТовары.Comment КАК TOVAR_PRIMECH,
	|	НеСозданныеЗаказыПокупателейТовары.Price * НеСозданныеЗаказыПокупателейТовары.Count КАК SUMMA,
	|	НеСозданныеЗаказыПокупателейТовары.Articul КАК ARTICUL_OUT,
	|	НеСозданныеЗаказыПокупателейТовары.Name КАК TOVAR_NAME,
	|	НеСозданныеЗаказыПокупателейТовары.Brand КАК BREND,
	|	НеСозданныеЗаказыПокупателейТовары.EDIzmer КАК ED_IZM,
	|	НеСозданныеЗаказыПокупателейТовары.Price_Zak,
	|	НеСозданныеЗаказыПокупателейТовары.Причина,
	|	НеСозданныеЗаказыПокупателейТовары.РазрешеноКОтгрузке,
	|	НеСозданныеЗаказыПокупателейТовары.ЦенаОтгрузки,
	|	НеСозданныеЗаказыПокупателейТовары.ПроизводительПоставщика,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Ссылка,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Код КАК DCODE_6951,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата КАК DATE_TIMESTAMP,
	|	"""" КАК DCODE_6051,
	|	"""" КАК DDATE1_6051,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Наименование КАК FILIAL_NAME,
	|	ВЫРАЗИТЬ(НеСозданныеЗаказыПокупателейТовары.Ссылка.Comment КАК СТРОКА(100)) КАК DNOTE,
	|	""RUB"" КАК VALUTA_NAME,
	|	"""" КАК DOGOVOR_NAME,
	|	"""" КАК SKLAD_NAME,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.FirmID КАК OUR_FIRM,
	|	ПРЕДСТАВЛЕНИЕ(НеСозданныеЗаказыПокупателейТовары.Ссылка.Контрагент) КАК UR_LICO,
	|	0 КАК REZERV_SUM
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.KontragentID = &KontragentID
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400*14)));
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("KontragentID", ИДАвардаКонтрагента);
	
	РезЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрРез Из РезЗапроса Цикл
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);		
		
		СтрокаВозврата.INV_NUM = СтрРез.INV_NUM;
		//СтрокаВозврата.VALUTA = СтрРез.VALUTA;
		СтрокаВозврата.KOEF = СтрРез.KOEF;
		СтрокаВозврата.KOL_VO = СтрРез.KOL_VO;
		СтрокаВозврата.PRICE = СтрРез.PRICE;
		СтрокаВозврата.SUMMA = СтрРез.SUMMA;
		СтрокаВозврата.ARTICUL_OUT = СтрРез.ARTICUL_OUT;
		СтрокаВозврата.TOVAR_NAME = СтрРез.TOVAR_NAME;
		СтрокаВозврата.BREND = СтрРез.BREND;
		СтрокаВозврата.ED_IZM = СтрРез.ED_IZM;		
		СтрокаВозврата.DATE_TIMESTAMP = СтрРез.DATE_TIMESTAMP;
		//СтрокаВозврата.DCODE_6051 = СтрРез.DCODE_6051;
		//СтрокаВозврата.DDATE1_6051 = СтрРез.DDATE1_6051;
		СтрокаВозврата.FILIAL_NAME = СтрРез.FILIAL_NAME;
		СтрокаВозврата.DNOTE = СтрРез.DNOTE;
		СтрокаВозврата.VALUTA_NAME = СтрРез.VALUTA_NAME;
		СтрокаВозврата.DOGOVOR_NAME = СтрРез.DOGOVOR_NAME;
		СтрокаВозврата.SKLAD_NAME = СтрРез.SKLAD_NAME;
		СтрокаВозврата.OUR_FIRM = СтрРез.OUR_FIRM;
		СтрокаВозврата.UR_LICO = СтрРез.UR_LICO;
		
		СтрокаВозврата.DID_6951 = СокрЛП(СтрРез.Ссылка.УникальныйИдентификатор());
		СтрокаВозврата.DDATE1_6951 = Формат(СтрРез.DATE_TIMESTAMP, "ДФ='dd.MM.yyyy HH:mm'");
		СтрокаВозврата.DCODE_6951 = "Заказ от " + СтрокаВозврата.DDATE1_6951;
		СтрокаВозврата.STATUS = "10; принят в работу";
		СтрокаВозврата.REZERV_SUM = РезЗапроса.Итог("SUMMA");
		
		СтрокаВозврата.FLAG_1 = "0000";
		
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		
	КонецЦикла;	
	
КонецПроцедуры
